//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСправочникеНоменклатураПоявляютсяЭлементы()","ВСправочникеНоменклатураПоявляютсяЭлементы","тогда в справочнике номенклатура появляются элементы");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗагружаюДанныеИзФикстуры()","ЯЗагружаюДанныеИзФикстуры","Когда я загружаю данные из фикстуры ""ЭлементыНоменклатуры""");
	
	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции


&НаКлиенте
Функция ПолучитьПутьКФайлОтносительноКаталогоFeatures(ИмяФайлаСРасширением)
	ПутьКФайлу = "";
	
	СостояниеVanessaBehavior = Ванесса.ПолучитьСостояниеVanessaBehavior();
	
	ПутьКТекущемуFeatureФайлу = СостояниеVanessaBehavior.ТекущаяФича.ПолныйПуть;
	
	ПутьКФайлу = Лев(ПутьКТекущемуFeatureФайлу, СтрНайти(ПутьКТекущемуFeatureФайлу, "features") - 1) + ИмяФайлаСРасширением;
	
	Возврат ПутьКФайлу;
КонецФункции

&НаКлиенте
Функция ПолучитьПутьКОбработкеПроверкиПоведенияТекущейФичи()
	
	СостояниеVanessaBehavior = Ванесса.ПолучитьСостояниеVanessaBehavior();
	
	ПутьКТекущемуFeatureФайлу = СостояниеVanessaBehavior.ТекущаяФича.ПолныйПуть;
	
	Файл = Новый Файл(ПутьКТекущемуFeatureФайлу);
	
	ИмяТекущегоFeatureФайла = Файл.ИмяБезРасширения;
	КаталогТекущегоFeatureФайла = Файл.Путь;
	
	Файл = Неопределено;
	
	ПутьКОбработкеПроверкиПоведения = КаталогТекущегоFeatureФайла + "step_definitions\" + ИмяТекущегоFeatureФайла + ".epf"; 
	
	Возврат ПутьКОбработкеПроверкиПоведения;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьFixtureИзМакета(ИмяМакета)
	Ванесса.ЗапретитьВыполнениеШагов();
		
	ДополнительныеПараметры = Новый Структура("ИмяМакета", ИмяМакета);
	
	ПоместитьОбработкуВыгрузкаИЗагрузкаДанныхXMLНаСервер(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьОбработкуВыгрузкаИЗагрузкаДанныхXMLНаСервер(ДополнительныеПараметры)
	
	НачальноеИмяФайла = ПолучитьПутьКФайлОтносительноКаталогоFeatures("tools\Выгрузка и загрузка данных XML.epf");
		
	Адрес = "";
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПоместитьОбработкуВыгрузкаИЗагрузкаДанныхXMLНаСерверЗавершение", ЭтотОбъект, ДополнительныеПараметры), Адрес, НачальноеИмяФайла, Ложь);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоместитьОбработкуВыгрузкаИЗагрузкаДанныхXMLНаСерверЗавершение(УдалосьПоместитьФайл, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Вставить("АдресОбработкиВыгрузкаИЗагрузкаДанныхXML", Адрес);
	
	ПоместитьОбработкуПроверкиПоведенияНаСервер(ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьОбработкуПроверкиПоведенияНаСервер(ДополнительныеПараметры)
	
	ПутьКОбработкеПроверкиПоведения = ПолучитьПутьКОбработкеПроверкиПоведенияТекущейФичи();
	
	Адрес = "";
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПоместитьОбработкуПроверкиПоведенияНаСерверЗавершение", ЭтотОбъект, ДополнительныеПараметры), Адрес, ПутьКОбработкеПроверкиПоведения, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьОбработкуПроверкиПоведенияНаСерверЗавершение(УдалосьПоместитьФайл, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры)  Экспорт
	
	ДополнительныеПараметры.Вставить("АдресОбработкиПроверкиПоведения", Адрес);
	
	ЗагрузитьFixtureИзМакетаЗавершениеНаСервере(ДополнительныеПараметры);
	
	Ванесса.ПродолжитьВыполнениеШагов();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьFixtureИзМакетаЗавершениеНаСервере(ДополнительныеПараметры)
	
	АдресОбработкиВыгрузкаИЗагрузкаДанныхXML = ДополнительныеПараметры.АдресОбработкиВыгрузкаИЗагрузкаДанныхXML;
	АдресОбработкиПроверкиПоведения = ДополнительныеПараметры.АдресОбработкиПроверкиПоведения;
	ИмяМакета = ДополнительныеПараметры.ИмяМакета;
	
	ВыгрузкаИЗагрузкаДанныхXML = ПолучитьОбъектОбработкиПоАдресу(АдресОбработкиВыгрузкаИЗагрузкаДанныхXML);
	ОбработкаПроверкиПоведения = ПолучитьОбъектОбработкиПоАдресу(АдресОбработкиПроверкиПоведения);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	Текст = ОбработкаПроверкиПоведения.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	
	ВременныйДокумент = Новый ТекстовыйДокумент;
	ВременныйДокумент.УстановитьТекст(Текст);
	ВременныйДокумент.Записать(ИмяВременногоФайла, КодировкаТекста.UTF8);

	ВыгрузкаИЗагрузкаДанныхXML.ВыполнитьЗагрузку(ИмяВременногоФайла);
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектОбработкиПоАдресу(АдресВХранилище)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяВременногоФайла, Ложь);
	
	Возврат ВнешняяОбработка;
	
КонецФункции	


///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//тогда в справочнике номенклатура появляются элементы
//@ВСправочникеНоменклатураПоявляютсяЭлементы()
Процедура ВСправочникеНоменклатураПоявляютсяЭлементы() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и я загружаю данные из фикстуры "ЭлементыНоменклатуры"
//@ЯЗагружаюДанныеИзФикстуры(Парам01)
Процедура ЯЗагружаюДанныеИзФикстуры(ИмяМакета) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ЗагрузитьFixtureИзМакета(ИмяМакета)
КонецПроцедуры

//окончание текста модуля