//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПодготавливаюОстаткиТоваров()","ЯПодготавливаюОстаткиТоваров","И я подготавливаю остатки товаров");
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗагружаюДанныеИзФикстуры()","ЯЗагружаюДанныеИзФикстуры","Когда я загружаю данные из фикстуры ""ЭлементыНоменклатуры""");
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗагружаюДанныеИзФикстуры()","ЯЗагружаюДанныеИзФикстуры","Когда я загружаю данные из фикстуры ""ЗакупкаТоваровИУслуг""");
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗагружаюДанныеИзФикстуры(Парам01)","ЯЗагружаюДанныеИзФикстуры","тогда я загружаю данные из фикстуры ""ЭлементыНоменклатуры""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВЛогеНетСообщений()","ВЛогеНетСообщений","И в логе нет сообщений");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И я подготавливаю остатки товаров
//@ЯПодготавливаюОстаткиТоваров()
Процедура ЯПодготавливаюОстаткиТоваров() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И в логе нет сообщений
//@ВЛогеНетСообщений()
Процедура ВЛогеНетСообщений() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	МассивСообщений = КонтекстСохраняемый.ТестовоеПриложение.ПолучитьАктивноеОкно().ПолучитьТекстыСообщенийПользователю();
	Если МассивСообщений.Количество() > 0 тогда
		ВызватьИсключение "Лог сообщений текущего активного окна не пустой. Сообщений быть не должно.";
	КонецЕсли;	
КонецПроцедуры

//окончание текста модуля