//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУдаляюВсеЭлементыИз(Парам01,Парам02)","ЯУдаляюВсеЭлементыИз","Когда я удаляю все элементы из ""справочник"" ""Номенклатура""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НеСодержитЭлементов(Парам01,Парам02)","НеСодержитЭлементов","тогда ""справочник"" ""Номенклатура"" не содержит элементов");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

&НаСервере
Процедура УдалитьВсеЭлементыТаблицыОбъектногоТипа(ИмяКоллекции, ИмяТаблицы)
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Таблица.Ссылка
		|ИЗ
		|	" + ИмяКоллекции +"." + ИмяТаблицы + " КАК Таблица";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			ОбъектДляУдаления = Выборка.Ссылка.ПолучитьОбъект();	
			ОбъектДляУдаления.Удалить();
		
		КонецЦикла;	
		
	исключение
		
		ВызватьИсключение "Не удалось найти талицу " + ИмяКоллекции +"." + ИмяТаблицы;
		
	КонецПопытки;	
	
КонецПроцедуры

&НаСервере
Функция ТаблицаОбъектногоТипаНеСодержитЭлементов(ИмяКоллекции, ИмяТаблицы)
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Таблица.Ссылка
		|ИЗ
		|	" + ИмяКоллекции +"." + ИмяТаблицы + " КАК Таблица";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		
	исключение
		
		ВызватьИсключение "Не удалось найти талицу " + ИмяКоллекции +"." + ИмяТаблицы;
		
	КонецПопытки;	
	
КонецФункции

///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И я удаляю все элементы из "справочник" "Номенклатура"
//@ЯУдаляюВсеЭлементыИз(ИмяКоллекции,ИмяТаблицы)
Процедура ЯУдаляюВсеЭлементыИз(ИмяКоллекции,ИмяТаблицы) Экспорт
	//Ванесса.ПосмотретьЗначение(ИмяКоллекции,Истина);
	УдалитьВсеЭлементыТаблицыОбъектногоТипа(ИмяКоллекции, ИмяТаблицы);
КонецПроцедуры


&НаКлиенте
//тогда "справочник" "Номенклатура" не содержит элементов
//@НеСодержитЭлементов(Парам01,Парам02)
Процедура НеСодержитЭлементов(ИмяКоллекции,ИмяТаблицы) Экспорт
	//Ванесса.ПосмотретьЗначение(ИмяКоллекции,Истина);
	Если не ТаблицаОбъектногоТипаНеСодержитЭлементов(ИмяКоллекции, ИмяТаблицы) тогда
		ВызватьИсключение "Таблица " + ИмяКоллекции +"." + ИмяТаблицы + " не пустая.";
	КонецЕсли;	
КонецПроцедуры

//окончание текста модуля